//
//  PostData.swift
//  Navigation
//
//  Created by Руфат Багирли on 03.04.2022.
//

import Foundation

var post1 = Post(author: "AC/DC", description: "AC/DC -  австралийская рок-группа, сформированная в Сиднее в ноябре 1973 года выходцами из Шотландии, братьями Малькольмом и Ангусом Янгами. Сами же музыканты классифицировали свою музыку как рок-н-ролл, поскольку в её основе лежит ритм-н-блюз с сильно искажённым звучанием ритмической и соло-гитар.", image: "foto_zvezd_01", likes: 10, views: 10, isLiked: false, isViewed: false, id: 1)
var post2 = Post(author: "LED ZEPPELIN", description: "LED ZEPPELIN - британская рок-группа, образовавшаяся в сентябре 1968 года в Лондоне, и признанная одной из самых успешных, новаторских и влиятельных в современной истории. Создав собственное звучание (для которого были характерны утяжелённый гитарный драйв, оглушающее звучание ритм-секции и пронзительный вокал), Led Zeppelin стали одной из ведущих групп хард-рока, сыграли основополагающую роль в становлении хеви-метала, свободно интерпретируя фолк- и блюз-классику и обогащая стиль элементами других музыкальных жанров (рокабилли, рэгги, соул, фанка, кантри).", image: "foto_zvezd_09", likes: 10, views: 10, isLiked: false, isViewed: false, id: 2)
var post3 = Post(author: "Pink Floyd", description: "Pink Floyd - британская рок-группа, знаменитая своими продолжительными композициями и объединёнными в тематические сюиты песнями, звуковыми экспериментами, философскими текстами, дизайном обложек альбомов и грандиозными концертными шоу. Является одной из наиболее влиятельных и коммерчески успешных групп в истории мировой рок-музыки — в её активе более 250 млн проданных альбомов в мире, в том числе 75 млн — в США", image: "foto_zvezd_03", likes: 10, views: 10, isLiked: false, isViewed: false, id: 3)
